#Задача 2
a = int(input('Введите число'))
print(a + 2)





