#Задача 1
a = 10
b = 20
print(a)
print(b)
c = input('Введите переменную')
print(c)

